In [2]:
import pandas as pd
import seaborn as sns

In [4]:
df = sns.load_dataset('flights')
df.head(3)

   year month  passengers
0  1949   Jan         112
1  1949   Feb         118
2  1949   Mar         132

In [7]:
df['year'] = pd.to_datetime(df['year'],format='%Y')
df.year.head(3)

0   1949-01-01
1   1949-01-01
2   1949-01-01
Name: year, dtype: datetime64[ns]

In [9]:
from datetime import datetime
current_date=datetime.now()
current_date

datetime.datetime(2022, 5, 9, 21, 49, 16, 383412)

In [10]:
date = current_date.strftime(('%d' + ' ' +'%b' +' ' + '%Y'))
date

'09 May 2022'

In [11]:
datetime.strptime(date, '%d %b %Y')

datetime.datetime(2022, 5, 9, 0, 0)

In [13]:
from datetime import timedelta 
two_days_before = current_date.now()-timedelta(days=2)
two_days_before

datetime.datetime(2022, 5, 7, 21, 53, 52, 129715)

In [17]:
current_date = datetime.now()
print(current_date)
print(current_date.date())

2022-05-09 21:56:20.688294
2022-05-09

In [18]:
from datetime import date
print(date.today())

2022-05-09

In [21]:
current_date = datetime.now()
print(current_date.day)
print(current_date.month)
print(current_date.year)

9
5
2022

### Convert datetime into string
>strftime

In [25]:
current_date=datetime.now()
print(current_date.strftime('%d'))
print(current_date.strftime('%B'))
print(current_date.strftime('%W'))

09
May
19

### Convert string into datetime
>strptime

In [31]:
str1 = '2022-12-31'
date1 = datetime.strptime(str1, '%Y-%m-%d')
print(date1)
print(date1.year)
print(date1.month)
print(date1.day)

2022-12-31 00:00:00
2022
12
31

### Time Difference

In [34]:
from datetime import timedelta
import datetime

In [35]:
current_date=datetime.datetime.now()
date_after_10_days = current_date + timedelta(days=10)
print('Today date: ', current_date)
print('Date after 10 days: ', date_after_10_days)

Today date:  2022-05-09 22:12:17.676097
Date after 10 days:  2022-05-19 22:12:17.676097

In [38]:
print('Today date: ', current_date.date())
print('Date after 10 days: ', date_after_10_days.date())

Today date:  2022-05-09
Date after 10 days:  2022-05-19

### Get_Dummies Yöntemi
Machine Learning modelleri kategorik/sayısal olmayan verilerle çalışmadığından, kategorik verileri bir modele beslemeden önce sayısal verilere dönüştürmemiz gerekir. Get_Dummies yöntemi temel olarak kategorik değişkeni kukla/gösterge değişkenlerine dönüştürür.

In [40]:
import pandas as pd
df = pd.DataFrame([('Foreign Cinema', 289.0),
                  ('Liho Liho', 224.0),
                  ('500 Club', 80.5),
                  ('Foreign Cinema', 25.30)],
            columns=('name','Amount'))
df

             name  Amount
0  Foreign Cinema   289.0
1       Liho Liho   224.0
2        500 Club    80.5
3  Foreign Cinema    25.3

In [41]:
pd.get_dummies(df,columns=['name'])
#kendi karsiliklarina 1 degerini verdi, gerisi 0 degerini aldi.

   Amount  name_500 Club  name_Foreign Cinema  name_Liho Liho
0   289.0              0                    1               0
1   224.0              0                    0               1
2    80.5              1                    0               0
3    25.3              0                    1               0

In [43]:
pd.get_dummies(df,columns=['name'],prefix='dmy')
#eger isimlerin name ile baslamasini istemezsek 'prefix' ile degistirebiliriz

   Amount  dmy_500 Club  dmy_Foreign Cinema  dmy_Liho Liho
0   289.0             0                   1              0
1   224.0             0                   0              1
2    80.5             1                   0              0
3    25.3             0                   1              0

In [44]:
pd.get_dummies(df,columns=['name'],prefix='dmy', prefix_sep='*')

   Amount  dmy*500 Club  dmy*Foreign Cinema  dmy*Liho Liho
0   289.0             0                   1              0
1   224.0             0                   0              1
2    80.5             1                   0              0
3    25.3             0                   1              0

In [45]:
pd.get_dummies(df,columns=['name'],drop_first=True)
#ilk sutunu datadan cikartti

   Amount  name_Foreign Cinema  name_Liho Liho
0   289.0                    1               0
1   224.0                    0               1
2    80.5                    0               0
3    25.3                    1               0